mitulty/tiva_tm4c123gh6pmi/drivers/sysctl_registers.h
#ifndef SYSCTL_REGISTERS_H
#define SYSCTL_REGISTERS_H

#include "stdint.h"

/**
 * @file sysctl_registers.h
 * @brief System Control (SYSCTL) registers header file for Tiva C Series microcontrollers.
 */

//*****************************************************************************
//
// System Control registers (SYSCTL)
//
//*****************************************************************************
#define SYSCTL_DID0_R (*((volatile uint32_t *)0x400FE000))
#define SYSCTL_DID1_R (*((volatile uint32_t *)0x400FE004))
#define SYSCTL_DC0_R (*((volatile uint32_t *)0x400FE008))
#define SYSCTL_DC1_R (*((volatile uint32_t *)0x400FE010))
#define SYSCTL_DC2_R (*((volatile uint32_t *)0x400FE014))
#define SYSCTL_DC3_R (*((volatile uint32_t *)0x400FE018))
#define SYSCTL_DC4_R (*((volatile uint32_t *)0x400FE01C))
#define SYSCTL_DC5_R (*((volatile uint32_t *)0x400FE020))
#define SYSCTL_DC6_R (*((volatile uint32_t *)0x400FE024))
#define SYSCTL_DC7_R (*((volatile uint32_t *)0x400FE028))
#define SYSCTL_DC8_R (*((volatile uint32_t *)0x400FE02C))
#define SYSCTL_PBORCTL_R (*((volatile uint32_t *)0x400FE030))
#define SYSCTL_SRCR0_R (*((volatile uint32_t *)0x400FE040))
#define SYSCTL_SRCR1_R (*((volatile uint32_t *)0x400FE044))
#define SYSCTL_SRCR2_R (*((volatile uint32_t *)0x400FE048))
#define SYSCTL_RIS_R (*((volatile uint32_t *)0x400FE050))
#define SYSCTL_IMC_R (*((volatile uint32_t *)0x400FE054))
#define SYSCTL_MISC_R (*((volatile uint32_t *)0x400FE058))
#define SYSCTL_RESC_R (*((volatile uint32_t *)0x400FE05C))
#define SYSCTL_RCC_R (*((volatile uint32_t *)0x400FE060))
#define SYSCTL_GPIOHBCTL_R (*((volatile uint32_t *)0x400FE06C))
#define SYSCTL_RCC2_R (*((volatile uint32_t *)0x400FE070))
#define SYSCTL_MOSCCTL_R (*((volatile uint32_t *)0x400FE07C))
#define SYSCTL_RCGC0_R (*((volatile uint32_t *)0x400FE100))
#define SYSCTL_RCGC1_R (*((volatile uint32_t *)0x400FE104))
#define SYSCTL_RCGC2_R (*((volatile uint32_t *)0x400FE108))
#define SYSCTL_SCGC0_R (*((volatile uint32_t *)0x400FE110))
#define SYSCTL_SCGC1_R (*((volatile uint32_t *)0x400FE114))
#define SYSCTL_SCGC2_R (*((volatile uint32_t *)0x400FE118))
#define SYSCTL_DCGC0_R (*((volatile uint32_t *)0x400FE120))
#define SYSCTL_DCGC1_R (*((volatile uint32_t *)0x400FE124))
#define SYSCTL_DCGC2_R (*((volatile uint32_t *)0x400FE128))
#define SYSCTL_DSLPCLKCFG_R (*((volatile uint32_t *)0x400FE144))
#define SYSCTL_SYSPROP_R (*((volatile uint32_t *)0x400FE14C))
#define SYSCTL_PIOSCCAL_R (*((volatile uint32_t *)0x400FE150))
#define SYSCTL_PIOSCSTAT_R (*((volatile uint32_t *)0x400FE154))
#define SYSCTL_PLLFREQ0_R (*((volatile uint32_t *)0x400FE160))
#define SYSCTL_PLLFREQ1_R (*((volatile uint32_t *)0x400FE164))
#define SYSCTL_PLLSTAT_R (*((volatile uint32_t *)0x400FE168))
#define SYSCTL_SLPPWRCFG_R (*((volatile uint32_t *)0x400FE188))
#define SYSCTL_DSLPPWRCFG_R (*((volatile uint32_t *)0x400FE18C))
#define SYSCTL_DC9_R (*((volatile uint32_t *)0x400FE190))
#define SYSCTL_NVMSTAT_R (*((volatile uint32_t *)0x400FE1A0))
#define SYSCTL_LDOSPCTL_R (*((volatile uint32_t *)0x400FE1B4))
#define SYSCTL_LDODPCTL_R (*((volatile uint32_t *)0x400FE1BC))
#define SYSCTL_PPWD_R (*((volatile uint32_t *)0x400FE300))
#define SYSCTL_PPTIMER_R (*((volatile uint32_t *)0x400FE304))
#define SYSCTL_PPGPIO_R (*((volatile uint32_t *)0x400FE308))
#define SYSCTL_PPDMA_R (*((volatile uint32_t *)0x400FE30C))
#define SYSCTL_PPHIB_R (*((volatile uint32_t *)0x400FE314))
#define SYSCTL_PPUART_R (*((volatile uint32_t *)0x400FE318))
#define SYSCTL_PPSSI_R (*((volatile uint32_t *)0x400FE31C))
#define SYSCTL_PPI2C_R (*((volatile uint32_t *)0x400FE320))
#define SYSCTL_PPUSB_R (*((volatile uint32_t *)0x400FE328))
#define SYSCTL_PPCAN_R (*((volatile uint32_t *)0x400FE334))
#define SYSCTL_PPADC_R (*((volatile uint32_t *)0x400FE338))
#define SYSCTL_PPACMP_R (*((volatile uint32_t *)0x400FE33C))
#define SYSCTL_PPPWM_R (*((volatile uint32_t *)0x400FE340))
#define SYSCTL_PPQEI_R (*((volatile uint32_t *)0x400FE344))
#define SYSCTL_PPEEPROM_R (*((volatile uint32_t *)0x400FE358))
#define SYSCTL_PPWTIMER_R (*((volatile uint32_t *)0x400FE35C))
#define SYSCTL_SRWD_R (*((volatile uint32_t *)0x400FE500))
#define SYSCTL_SRTIMER_R (*((volatile uint32_t *)0x400FE504))
#define SYSCTL_SRGPIO_R (*((volatile uint32_t *)0x400FE508))
#define SYSCTL_SRDMA_R (*((volatile uint32_t *)0x400FE50C))
#define SYSCTL_SRHIB_R (*((volatile uint32_t *)0x400FE514))
#define SYSCTL_SRUART_R (*((volatile uint32_t *)0x400FE518))
#define SYSCTL_SRSSI_R (*((volatile uint32_t *)0x400FE51C))
#define SYSCTL_SRI2C_R (*((volatile uint32_t *)0x400FE520))
#define SYSCTL_SRUSB_R (*((volatile uint32_t *)0x400FE528))
#define SYSCTL_SRCAN_R (*((volatile uint32_t *)0x400FE534))
#define SYSCTL_SRADC_R (*((volatile uint32_t *)0x400FE538))
#define SYSCTL_SRACMP_R (*((volatile uint32_t *)0x400FE53C))
#define SYSCTL_SRPWM_R (*((volatile uint32_t *)0x400FE540))
#define SYSCTL_SRQEI_R (*((volatile uint32_t *)0x400FE544))
#define SYSCTL_SREEPROM_R (*((volatile uint32_t *)0x400FE558))
#define SYSCTL_SRWTIMER_R (*((volatile uint32_t *)0x400FE55C))
#define SYSCTL_RCGCWD_R (*((volatile uint32_t *)0x400FE600))
#define SYSCTL_RCGCTIMER_R (*((volatile uint32_t *)0x400FE604))
#define SYSCTL_RCGCGPIO_R (*((volatile uint32_t *)0x400FE608))
#define SYSCTL_RCGCDMA_R (*((volatile uint32_t *)0x400FE60C))
#define SYSCTL_RCGCHIB_R (*((volatile uint32_t *)0x400FE614))
#define SYSCTL_RCGCUART_R (*((volatile uint32_t *)0x400FE618))
#define SYSCTL_RCGCSSI_R (*((volatile uint32_t *)0x400FE61C))
#define SYSCTL_RCGCI2C_R (*((volatile uint32_t *)0x400FE620))
#define SYSCTL_RCGCUSB_R (*((volatile uint32_t *)0x400FE628))
#define SYSCTL_RCGCCAN_R (*((volatile uint32_t *)0x400FE634))
#define SYSCTL_RCGCADC_R (*((volatile uint32_t *)0x400FE638))
#define SYSCTL_RCGCACMP_R (*((volatile uint32_t *)0x400FE63C))
#define SYSCTL_RCGCPWM_R (*((volatile uint32_t *)0x400FE640))
#define SYSCTL_RCGCQEI_R (*((volatile uint32_t *)0x400FE644))
#define SYSCTL_RCGCEEPROM_R (*((volatile uint32_t *)0x400FE658))
#define SYSCTL_RCGCWTIMER_R (*((volatile uint32_t *)0x400FE65C))
#define SYSCTL_SCGCWD_R (*((volatile uint32_t *)0x400FE700))
#define SYSCTL_SCGCTIMER_R (*((volatile uint32_t *)0x400FE704))
#define SYSCTL_SCGCGPIO_R (*((volatile uint32_t *)0x400FE708))
#define SYSCTL_SCGCDMA_R (*((volatile uint32_t *)0x400FE70C))
#define SYSCTL_SCGCHIB_R (*((volatile uint32_t *)0x400FE714))
#define SYSCTL_SCGCUART_R (*((volatile uint32_t *)0x400FE718))
#define SYSCTL_SCGCSSI_R (*((volatile uint32_t *)0x400FE71C))
#define SYSCTL_SCGCI2C_R (*((volatile uint32_t *)0x400FE720))
#define SYSCTL_SCGCUSB_R (*((volatile uint32_t *)0x400FE728))
#define SYSCTL_SCGCCAN_R (*((volatile uint32_t *)0x400FE734))
#define SYSCTL_SCGCADC_R (*((volatile uint32_t *)0x400FE738))
#define SYSCTL_SCGCACMP_R (*((volatile uint32_t *)0x400FE73C))
#define SYSCTL_SCGCPWM_R (*((volatile uint32_t *)0x400FE740))
#define SYSCTL_SCGCQEI_R (*((volatile uint32_t *)0x400FE744))
#define SYSCTL_SCGCEEPROM_R (*((volatile uint32_t *)0x400FE758))
#define SYSCTL_SCGCWTIMER_R (*((volatile uint32_t *)0x400FE75C))
#define SYSCTL_DCGCWD_R (*((volatile uint32_t *)0x400FE800))
#define SYSCTL_DCGCTIMER_R (*((volatile uint32_t *)0x400FE804))
#define SYSCTL_DCGCGPIO_R (*((volatile uint32_t *)0x400FE808))
#define SYSCTL_DCGCDMA_R (*((volatile uint32_t *)0x400FE80C))
#define SYSCTL_DCGCHIB_R (*((volatile uint32_t *)0x400FE814))
#define SYSCTL_DCGCUART_R (*((volatile uint32_t *)0x400FE818))
#define SYSCTL_DCGCSSI_R (*((volatile uint32_t *)0x400FE81C))
#define SYSCTL_DCGCI2C_R (*((volatile uint32_t *)0x400FE820))
#define SYSCTL_DCGCUSB_R (*((volatile uint32_t *)0x400FE828))
#define SYSCTL_DCGCCAN_R (*((volatile uint32_t *)0x400FE834))
#define SYSCTL_DCGCADC_R (*((volatile uint32_t *)0x400FE838))
#define SYSCTL_DCGCACMP_R (*((volatile uint32_t *)0x400FE83C))
#define SYSCTL_DCGCPWM_R (*((volatile uint32_t *)0x400FE840))
#define SYSCTL_DCGCQEI_R (*((volatile uint32_t *)0x400FE844))
#define SYSCTL_DCGCEEPROM_R (*((volatile uint32_t *)0x400FE858))
#define SYSCTL_DCGCWTIMER_R (*((volatile uint32_t *)0x400FE85C))
#define SYSCTL_PRWD_R (*((volatile uint32_t *)0x400FEA00))
#define SYSCTL_PRTIMER_R (*((volatile uint32_t *)0x400FEA04))
#define SYSCTL_PRGPIO_R (*((volatile uint32_t *)0x400FEA08))
#define SYSCTL_PRDMA_R (*((volatile uint32_t *)0x400FEA0C))
#define SYSCTL_PRHIB_R (*((volatile uint32_t *)0x400FEA14))
#define SYSCTL_PRUART_R (*((volatile uint32_t *)0x400FEA18))
#define SYSCTL_PRSSI_R (*((volatile uint32_t *)0x400FEA1C))
#define SYSCTL_PRI2C_R (*((volatile uint32_t *)0x400FEA20))
#define SYSCTL_PRUSB_R (*((volatile uint32_t *)0x400FEA28))
#define SYSCTL_PRCAN_R (*((volatile uint32_t *)0x400FEA34))
#define SYSCTL_PRADC_R (*((volatile uint32_t *)0x400FEA38))
#define SYSCTL_PRACMP_R (*((volatile uint32_t *)0x400FEA3C))
#define SYSCTL_PRPWM_R (*((volatile uint32_t *)0x400FEA40))
#define SYSCTL_PRQEI_R (*((volatile uint32_t *)0x400FEA44))
#define SYSCTL_PREEPROM_R (*((volatile uint32_t *)0x400FEA58))
#define SYSCTL_PRWTIMER_R (*((volatile uint32_t *)0x400FEA5C))

#endif // SYSCTL_REGISTERS_H